{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      ",": 3,
      "?": 4,
      "a": 5,
      "b": 6,
      "c": 7,
      "d": 8,
      "e": 9,
      "f": 10,
      "g": 11,
      "h": 12,
      "i": 13,
      "j": 14,
      "k": 15,
      "l": 16,
      "m": 17,
      "n": 18,
      "o": 19,
      "p": 20,
      "r": 21,
      "s": 22,
      "t": 23,
      "u": 24,
      "v": 25,
      "w": 26,
      "y": 27,
      "z": 28,
      "ku": 29,
      "ni": 30,
      "na": 31,
      "ha": 32,
      "wa": 33,
      "ki": 34,
      "za": 35,
      "nd": 36,
      "ya": 37,
      "yo": 38,
      "ina": 39,
      "pe": 40,
      "pend": 41,
      "li": 42,
      "kwa": 43,
      "sa": 44,
      "penda": 45,
      "tu": 46,
      "hi": 47,
      "ka": 48,
      "hu": 49,
      "ri": 50,
      "ot": 51,
      "aina": 52,
      "ny": 53,
      "in": 54,
      "ma": 55,
      "si": 56,
      "ani": 57,
      "ba": 58,
      "fa": 59,
      "iz": 60,
      "la": 61,
      "me": 62,
      "uri": 63,
      "gani": 64,
      "ia": 65,
      "sha": 66,
      "su": 67,
      "we": 68,
      "kuhu": 69,
      "hiyo": 70,
      "kuhusu": 71,
      "ch": 72,
      "id": 73,
      "sawa": 74,
      "ote": 75,
      "bu": 76,
      "ipenda": 77,
      "ika": 78,
      "ra": 79,
      "haku": 80,
      "kitu": 81,
      "zaid": 82,
      "zaidi": 83,
      "le": 84,
      "nz": 85,
      "uli": 86,
      "kuku": 87,
      "kili": 88,
      "nye": 89,
      "sifa": 90,
      "kukuza": 91,
      "be": 92,
      "gin": 93,
      "ja": 94,
      "ko": 95,
      "mo": 96,
      "viz": 97,
      "kuki": 98,
      "nime": 99,
      "saba": 100,
      "nyin": 101,
      "kilimo": 102,
      "gine": 103,
      "vizuri": 104,
      "sababu": 105,
      "nyingine": 106,
      "am": 107,
      "au": 108,
      "bia": 109,
      "chaku": 110,
      "iyo": 111,
      "vyo": 112,
      "tum": 113,
      "hukuki": 114,
      "izi": 115,
      "shara": 116,
      "biashara": 117,
      "chakula": 118,
      "ele": 119,
      "ipend": 120,
      "kwe": 121,
      "pa": 122,
      "uki": 123,
      "livyo": 124,
      "matum": 125,
      "bayo": 126,
      "cho": 127,
      "otesha": 128,
      "nzuri": 129,
      "bei": 130,
      "nimeipenda": 131,
      "ambayo": 132,
      "hukukipenda": 133,
      "kwenye": 134,
      "matumizi": 135,
      "ge": 136,
      "ip": 137,
      "oko": 138,
      "soko": 139,
      "te": 140,
      "una": 141,
      "kua": 142,
      "kufa": 143,
      "nini": 144,
      "hai": 145,
      "jaza": 146,
      "bi": 147,
      "cot": 148,
      "da": 149,
      "eza": 150,
      "ili": 151,
      "iko": 152,
      "ju": 153,
      "mna": 154,
      "nya": 155,
      "po": 156,
      "ta": 157,
      "tri": 158,
      "uipend": 159,
      "ze": 160,
      "kui": 161,
      "nilivyo": 162,
      "hapa": 163,
      "ndiyo": 164,
      "kama": 165,
      "ota": 166,
      "chote": 167,
      "hakuna": 168,
      "ulipenda": 169,
      "chochote": 170,
      "kufanya": 171,
      "tricot": 172,
      "uipende": 173,
      "cha": 174,
      "chi": 175,
      "gu": 176,
      "iv": 177,
      "ipe": 178,
      "ime": 179,
      "ibu": 180,
      "je": 181,
      "keza": 182,
      "mla": 183,
      "mbe": 184,
      "pia": 185,
      "pika": 186,
      "se": 187,
      "shi": 188,
      "uka": 189,
      "uju": 190,
      "ucha": 191,
      "zote": 192,
      "ziko": 193,
      "kuna": 194,
      "kund": 195,
      "kuotesha": 196,
      "kujaza": 197,
      "najaza": 198,
      "haya": 199,
      "haina": 200,
      "hara": 201,
      "hamna": 202,
      "zaa": 203,
      "yawe": 204,
      "yanajaza": 205,
      "inakua": 206,
      "inaiv": 207,
      "inazaa": 208,
      "kwahiyo": 209,
      "sasa": 210,
      "hii": 211,
      "kat": 212,
      "mahara": 213,
      "che": 214,
      "ikawa": 215,
      "leka": 216,
      "nze": 217,
      "ulicho": 218,
      "nyekund": 219,
      "jaota": 220,
      "eleze": 221,
      "elekeza": 222,
      "ipendi": 223,
      "ukiip": 224,
      "ukiipe": 225,
      "ipi": 226,
      "sokoni": 227,
      "unapika": 228,
      "haikui": 229,
      "haijaota": 230,
      "bila": 231,
      "hapana": 232,
      "chini": 233,
      "mbegu": 234,
      "shida": 235,
      "ukame": 236,
      "ujumla": 237,
      "uchache": 238,
      "inaiva": 239,
      "maharage": 240,
      "nyekundu": 241,
      "elezea": 242,
      "ukiipika": 243,
      "ukiipeleka": 244,
      "aia": 245,
      "anze": 246,
      "bwa": 247,
      "bda": 248,
      "em": 249,
      "epo": 250,
      "fi": 251,
      "fu": 252,
      "hem": 253,
      "it": 254
    },
    "merges": [
      "k u",
      "n i",
      "n a",
      "h a",
      "w a",
      "k i",
      "z a",
      "n d",
      "y a",
      "y o",
      "i na",
      "p e",
      "pe nd",
      "l i",
      "k wa",
      "s a",
      "pend a",
      "t u",
      "h i",
      "k a",
      "h u",
      "r i",
      "o t",
      "a ina",
      "n y",
      "i n",
      "m a",
      "s i",
      "a ni",
      "b a",
      "f a",
      "i z",
      "l a",
      "m e",
      "u ri",
      "g ani",
      "i a",
      "s ha",
      "s u",
      "w e",
      "ku hu",
      "hi yo",
      "kuhu su",
      "c h",
      "i d",
      "sa wa",
      "ot e",
      "b u",
      "i penda",
      "i ka",
      "r a",
      "ha ku",
      "ki tu",
      "za id",
      "zaid i",
      "l e",
      "n z",
      "u li",
      "ku ku",
      "ki li",
      "ny e",
      "si fa",
      "kuku za",
      "b e",
      "g in",
      "j a",
      "k o",
      "m o",
      "v iz",
      "ku ki",
      "ni me",
      "sa ba",
      "ny in",
      "kili mo",
      "gin e",
      "viz uri",
      "saba bu",
      "nyin gine",
      "a m",
      "a u",
      "b ia",
      "c haku",
      "i yo",
      "v yo",
      "tu m",
      "hu kuki",
      "iz i",
      "sha ra",
      "bia shara",
      "chaku la",
      "e le",
      "i pend",
      "k we",
      "p a",
      "u ki",
      "li vyo",
      "ma tum",
      "ba yo",
      "ch o",
      "ote sha",
      "nz uri",
      "be i",
      "nime ipenda",
      "am bayo",
      "hukuki penda",
      "kwe nye",
      "matum izi",
      "g e",
      "i p",
      "o ko",
      "s oko",
      "t e",
      "u na",
      "ku a",
      "ku fa",
      "ni ni",
      "ha i",
      "ja za",
      "b i",
      "c ot",
      "d a",
      "e za",
      "i li",
      "i ko",
      "j u",
      "m na",
      "n ya",
      "p o",
      "t a",
      "t ri",
      "u ipend",
      "z e",
      "ku i",
      "ni livyo",
      "ha pa",
      "nd iyo",
      "ka ma",
      "ot a",
      "ch ote",
      "haku na",
      "uli penda",
      "cho chote",
      "kufa nya",
      "tri cot",
      "uipend e",
      "c ha",
      "c hi",
      "g u",
      "i v",
      "i pe",
      "i me",
      "i bu",
      "j e",
      "k eza",
      "m la",
      "m be",
      "p ia",
      "p ika",
      "s e",
      "s hi",
      "u ka",
      "u ju",
      "u cha",
      "z ote",
      "z iko",
      "ku na",
      "ku nd",
      "ku otesha",
      "ku jaza",
      "na jaza",
      "ha ya",
      "ha ina",
      "ha ra",
      "ha mna",
      "za a",
      "ya we",
      "ya najaza",
      "ina kua",
      "ina iv",
      "ina zaa",
      "kwa hiyo",
      "sa sa",
      "hi i",
      "ka t",
      "ma hara",
      "ch e",
      "ika wa",
      "le ka",
      "nz e",
      "uli cho",
      "nye kund",
      "ja ota",
      "ele ze",
      "ele keza",
      "ipend i",
      "uki ip",
      "uki ipe",
      "ip i",
      "soko ni",
      "una pika",
      "hai kui",
      "hai jaota",
      "bi la",
      "hapa na",
      "chi ni",
      "mbe gu",
      "shi da",
      "uka me",
      "uju mla",
      "ucha che",
      "inaiv a",
      "mahara ge",
      "nyekund u",
      "eleze a",
      "ukiip ika",
      "ukiipe leka",
      "a ia",
      "a nze",
      "b wa",
      "b da",
      "e m",
      "e po",
      "f i",
      "f u",
      "h em",
      "i t"
    ]
  }
}